src/cfe/osn/InformationRegisters/СостоянияЗаказовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СостоянияЗаказовКлиентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроцентОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаОтгрузки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроцентОтгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДолга</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроцентДолга</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕстьРасхожденияОрдерНакладная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Заказ</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/osn/InformationRegisters/ДанныеБизнесПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДанныеБизнесПроцессов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Завершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Стартован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Владелец</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.БизнесПроцесс</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/osn/InformationRegisters/ТоварыКДоставке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварыКДоставке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВсеТовары</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПолучательОтправитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтправительПолучательДоставки</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаданиеНаПеревозку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Распоряжение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаДоставку</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/osn/Enums/СтатусыЗаданийНаПеревозку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыЗаданийНаПеревозку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Формируется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КПогрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыто</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/osn/Enums/СтатусыРасходныхОрдеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыРасходныхОрдеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Проверен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОтбору</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВПроцессеПроверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КПроверке</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/osn/Enums/СтатусыЗаказовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыЗаказовКлиентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОбеспечению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/osn/Enums/ТипыНалогообложенияНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыНалогообложенияНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПродажаНеОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПродажаОблагаетсяЕНВД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПродажаОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПродажаНаЭкспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалоговыйАгентПоНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОблагаетсяНДСУПокупателя</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/osn/CommonModules/_ДоработкиСлужебный/Ext/Module.bsl
#Область ОбработчикиПодписокНаСобытия

Функция Кт_ИсправитьНомер( Номер )
	Возврат Сред(Номер,2);
КонецФункции	

// Нумерация заказов клиента
Процедура НомерВЗаказеКлиентаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт

	Если Источник.ЭтоНовый() Тогда
		
		//ТекНомер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Источник.Номер, Истина, Истина);
		
		Префикс = Источник.Организация.Префикс;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ЗаказКлиента.Номер				КАК Номер
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.Организация = &Организация
		|	И ЗаказКлиента.Дата МЕЖДУ &ДатаН И &ДатаК
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер
		|";
		Запрос.УстановитьПараметр("Организация", Источник.Организация);
		Запрос.УстановитьПараметр("ДатаН",       НачалоДня(Источник.Дата));
		Запрос.УстановитьПараметр("ДатаК",       КонецДня(Источник.Дата));
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		РезультатЗапроса.Колонки.Добавить("НомерДляСортировки", Новый ОписаниеТипов( , , , , Новый КвалификаторыСтроки(11, ДопустимаяДлина.Переменная), , ), "Номер для сортировки", );
		Для Каждого СтрокаРезультата Из РезультатЗапроса Цикл
			СтрокаРезультата.НомерДляСортировки = Прав(СокрЛП(СтрокаРезультата.Номер), 3);
		КонецЦикла;
		
		РезультатЗапроса.Сортировать("НомерДляСортировки Убыв");
		Если РезультатЗапроса.Количество() > 0 Тогда
			
			ПерваяСтрока = РезультатЗапроса[0];
			Попытка
				НомерЧислом = ПерваяСтрока.НомерДляСортировки;
			Исключение
				НомерЧислом = 0;
			КонецПопытки;
			
			Если СтрДлина(СокрЛП(НомерЧислом + 1)) > 1 Тогда
				ТекНомер = "0"  + СокрЛП(НомерЧислом + 1);
			Иначе
				ТекНомер = "00" + СокрЛП(НомерЧислом + 1);
			КонецЕсли;
			
		Иначе
			ТекНомер = "001";
			
		КонецЕсли;
		
		Источник.Номер = Источник.Организация.Префикс + Формат(Источник.Дата, "ДФ=ddMMyy") + ТекНомер;
		
		а = 1;
		
	КонецЕсли;

КонецПроцедуры

// Нумерация реализаций товаров
Процедура НомерВРеализацииПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ЭтоНовый() ИЛИ НЕ ЗначениеЗаполнено(Источник.Номер) Тогда
		
		ТекДата = Формат(Источник.Дата, "ДФ=dd.MM.yy");
		Стр   = СтрЗаменить(ТекДата, ".", Символы.ПС);
		День  = СтрПолучитьСтроку(Стр, 1);
		Месяц = СтрПолучитьСтроку(Стр, 2);
		Год   = СтрПолучитьСтроку(Стр, 3);
		
		//ТекНомер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Источник.Номер, Истина, Истина);
		
		Префикс = Источник.Организация.Префикс;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Номер КАК Номер
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Организация = &Организация
		|	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаН И &ДатаК
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер";
		Запрос.УстановитьПараметр("Организация", Источник.Организация);
		Запрос.УстановитьПараметр("ДатаН",       НачалоДня(Источник.Дата));
		Запрос.УстановитьПараметр("ДатаК",       КонецДня(Источник.Дата));
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		ТЗ1 = Новый ТаблицаЗначений;
		ТЗ1.Колонки.Добавить("Номер");
		
		Пока Выборка.Следующий() Цикл
			СтрТЗ1 = ТЗ1.Добавить();
			СтрТЗ1.Номер = Прав(СокрЛП(Выборка.Номер), 3);
		КонецЦикла;
		
		ТЗ1.Сортировать("Номер Убыв");
		Если ТЗ1.Количество() > 0 Тогда
			Если СтрДлина(СокрЛП(Число(ТЗ1[0].Номер) + 1)) > 1 Тогда
				ТекНомер = "0" + СокрЛП(Число(ТЗ1[0].Номер) + 1);
			Иначе
				ТекНомер = "00" + СокрЛП(Число(ТЗ1[0].Номер) + 1);
			КонецЕсли;
		Иначе
			ТекНомер = "001";
		КонецЕсли;
		
		Источник.Номер = Источник.Организация.Префикс + День + Месяц + Год + ТекНомер;
		
		а = 1;
		
	КонецЕсли;

КонецПроцедуры

// Нумерация счетов факутр
Процедура НомерВСФПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт

	Если Источник.ЭтоНовый() ИЛИ НЕ ЗначениеЗаполнено(Источник.Номер) Тогда
		Если Источник.ДокументыОснования.Количество() > 0 Тогда
			Если ЗначениеЗаполнено(Источник.ДокументыОснования[0].ДокументОснование) Тогда
				Источник.Номер = Источник.ДокументыОснования[0].ДокументОснование.Номер;
				
				Если ( ОбщегоНазначения.ЕстьРеквизитОбъекта("ПредставлениеНомера", Источник.Метаданные()) ) Тогда
					Источник.ПредставлениеНомера = Кт_ИсправитьНомер( Источник.Номер );
				КонецЕсли;	
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// sazonov-yu-a@yandex.ru, общая процедура обработчика "При установке нового номера" для документов
Процедура ПриУстановкеНовогоНомераДокумента(Источник, СтандартнаяОбработка, Префикс) Экспорт

	//// При обмене оставляем объект как есть
	//Если Источник.ОбменДанными.Загрузка = Истина Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//// Определим алгоритм формирования номера, согласно типу объекта
	//Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказКлиента") Тогда
	//	ПрисвоитьНовыйНомерОбъектуЗаказКлиента(Источник, СтандартнаяОбработка, Префикс);
	//КонецЕсли;
	//
	//Если ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
	//	ПрисвоитьНовыйНомерОбъектуРеализацияТоваровУслуг(Источник, СтандартнаяОбработка, Префикс);
	//КонецЕсли;

КонецПроцедуры

// sazonov-yu-a@yandex.ru
// Источнику дадим новый номер
Процедура ПрисвоитьНовыйНомерОбъектуЗаказКлиента(Источник, СтандартнаяОбработка, Префикс)

	СтандартнаяОбработка = Ложь;
	
	ДатаИсточника = Источник.Дата;
	ДатаИсточника = ?(ЗначениеЗаполнено(ДатаИсточника), ДатаИсточника, ТекущаяДата());
	
	// Префикс документов "Заказ клиента"
	ПрефиксОрганизации = "00";
	Если ЗначениеЗаполнено(Источник.Организация) Тогда
		ПрефиксОрганизации = Источник.Организация.Префикс;
		ПрефиксНовый = ПрефиксОрганизации + Формат(ДатаИсточника, "ДФ=ddMMyy");
	Иначе
		ПрефиксНовый = ПрефиксОрганизации + Формат(ДатаИсточника, "ДФ=ddMMyy");
	КонецЕсли;
	
	НомерИсточника = Источник.Номер;
	
	Если НЕ ЗначениеЗаполнено(НомерИсточника) Тогда
		
		НомерДокументаПоТаблице = ПолучитьНомерДокументаПоТаблице(Новый Структура("ИмяТаблицы, ДатаПолученияДанных, Префикс", "ЗаказКлиента", ДатаИсточника, ПрефиксНовый));
		
		Если НомерДокументаПоТаблице = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Источник.Номер = НомерДокументаПоТаблице;
		
	Иначе
		
		НомерИсточника   = Формат(0, "ЧЦ=" + СтрДлина(Префикс) +"""; ЧВН=; ЧГ=0") + Прав(НомерИсточника, СтрДлина(НомерИсточника) - СтрДлина(Префикс)); // Нули вместо префикса
		НовыйНомерСтрока = ПрефиксНовый + Прав(НомерИсточника, СтрДлина(НомерИсточника) - СтрДлина(ПрефиксНовый)); // с лева подставляем свой префикс
		
		Источник.Номер = НовыйНомерСтрока;
		
	КонецЕсли;

КонецПроцедуры

// sazonov-yu-a@yandex.ru
// Источнику дадим новый номер
Процедура ПрисвоитьНовыйНомерОбъектуРеализацияТоваровУслуг(Источник, СтандартнаяОбработка, Префикс)

	СтандартнаяОбработка = Ложь;
	
	ДатаИсточника = Источник.Дата;
	ДатаИсточника = ?(ЗначениеЗаполнено(ДатаИсточника), ДатаИсточника, ТекущаяДата());
	
	// Префикс документов "Заказ клиента"
	ПрефиксОрганизации = "00";
	Если ЗначениеЗаполнено(Источник.Организация) Тогда
		ПрефиксОрганизации = Источник.Организация.Префикс;
		ПрефиксНовый = ПрефиксОрганизации + Формат(ДатаИсточника, "ДФ=ddMMyy");
	Иначе
		ПрефиксНовый = ПрефиксОрганизации + Формат(ДатаИсточника, "ДФ=ddMMyy");
	КонецЕсли;
	
	НомерИсточника = Источник.Номер;
	
	Если НЕ ЗначениеЗаполнено(НомерИсточника) Тогда
		
		НомерДокументаПоТаблице = ПолучитьНомерДокументаПоТаблице(Новый Структура("ИмяТаблицы, ДатаПолученияДанных, Префикс", "РеализацияТоваровУслуг", ДатаИсточника, ПрефиксНовый));
		
		Если НомерДокументаПоТаблице = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Источник.Номер = НомерДокументаПоТаблице;
		
	Иначе
		
		НомерИсточника   = Формат(0, "ЧЦ=" + СтрДлина(Префикс) +"""; ЧВН=; ЧГ=0") + Прав(НомерИсточника, СтрДлина(НомерИсточника) - СтрДлина(Префикс)); // Нули вместо префикса
		НовыйНомерСтрока = ПрефиксНовый + Прав(НомерИсточника, СтрДлина(НомерИсточника) - СтрДлина(ПрефиксНовый)); // с лева подставляем свой префикс
		
		Источник.Номер = НовыйНомерСтрока;
		
	КонецЕсли;

КонецПроцедуры

// sazonov-yu-a@yandex.ru
// Функция возвращает номер документа, следующего за последним :)
Функция ПолучитьНомерДокументаПоТаблице(ПараметрыЗапроса)

	Если НЕ ТипЗнч(ПараметрыЗапроса) = Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяТаблицы = Неопределено;
	ПараметрыЗапроса.Свойство("ИмяТаблицы", ИмяТаблицы);
	
	Если ИмяТаблицы = Неопределено ИЛИ СокрЛП(ИмяТаблицы) = "" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДокументОбъектМетаданных = Метаданные.Документы.Найти(СокрЛП(ИмяТаблицы));
	Если ДокументОбъектМетаданных = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДлинаНомера = ДокументОбъектМетаданных.ДлинаНомера;
	
	ДатаПолученияДанных = Неопределено;
	ПараметрыЗапроса.Свойство("ДатаПолученияДанных", ДатаПолученияДанных);
	Если НЕ ТипЗнч(ДатаПолученияДанных) = Тип("Дата") Тогда
		ДатаПолученияДанных = ТекущаяДата();
	КонецЕсли;
	
	Префикс = "00-";
	ПараметрыЗапроса.Свойство("Префикс", Префикс);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТаблицаДокументов.Номер
	|ИЗ
	|	Документ."+ ИмяТаблицы + " КАК ТаблицаДокументов
	|ГДЕ
	|	ТаблицаДокументов.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаПолученияДанных, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаПолученияДанных, ДЕНЬ)
	|	И ТаблицаДокументов.Номер ПОДОБНО """ + Префикс + "%""
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаДокументов.Номер УБЫВ
	|";
	
	Запрос.УстановитьПараметр("ДатаПолученияДанных", ?(НЕ ЗначениеЗаполнено(ДатаПолученияДанных), ТекущаяДата(), ДатаПолученияДанных));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		СтрокаНулей = "";
		Для Итератор = 1 По ДлинаНомера Цикл
			СтрокаНулей = СтрокаНулей + "0";
		КонецЦикла;
		
		ПоследнийНомерПоТаблице = СтрокаНулей;
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ПоследнийНомерПоТаблице = Выборка.Номер;
		
	КонецЕсли;
	
	ДлинаПолученногоНомера = СтрДлина(ПоследнийНомерПоТаблице);
	ОписаниеТиповЧисло = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(ДлинаПолученногоНомера, 0));
	
	СтрокаЧислоВНомере = "";
	Для Итератор = 0 По ДлинаПолученногоНомера - 1 Цикл
		
		СимволВНомере = Сред(ПоследнийНомерПоТаблице, ДлинаПолученногоНомера - Итератор, 1);
		СтрокаЧислоВНомере = ?(Найти("0123456789", СимволВНомере) = 0, "0", СимволВНомере) + СтрокаЧислоВНомере;
		
	КонецЦикла;
	
	ЧислоВНомере = ОписаниеТиповЧисло.ПривестиЗначение(СтрокаЧислоВНомере);
	Если НЕ ТипЗнч(ЧислоВНомере) = Тип("Число") Тогда
		ЧислоВНомере = 0;
	КонецЕсли;
	
	НовыйНомерСтрока = Формат(ЧислоВНомере + 1, "ЧЦ=" + ДлинаПолученногоНомера +"""; ЧВН=; ЧГ=0");
	
	НовыйНомерСтрока = Префикс + Прав(НовыйНомерСтрока, ДлинаПолученногоНомера - СтрДлина(Префикс));
	
	Возврат НовыйНомерСтрока;

КонецФункции


#КонецОбласти

#Область ОбработкиПроведенияДокументов
Процедура ДополнительноПриПроведенииДокументов(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Источник.Статус = Перечисления.СтатусыЗаданийНаПеревозку.КПогрузке ИЛИ Источник.Статус = Перечисления.СтатусыЗаданийНаПеревозку.Формируется Тогда	
		ТоварыКДоставке = ЗаполнитьТоварыКДоставке(Источник);
		ТзРаспоряжения = Источник.Распоряжения.Выгрузить();
		
		//++ 25.02.2025 КОМПИТ 
		// При проведении и смене статуса Задания на перевозку будем менять только статус ордера. Статус отгрузки и задание не трогаем
		// Ниже по коду закомментировано
		//Если Источник.Статус = Перечисления.СтатусыЗаданийНаПеревозку.КПогрузке Тогда
		//	СтатусОрдера	   = Перечисления.СтатусыРасходныхОрдеров.КОтгрузке;
		//	СтатусОтгрузки	   = Истина;
		//	ЗаданиеНаПеревозку = Источник.Ссылка;
		//Иначе
		//	СтатусОрдера	   = Перечисления.СтатусыРасходныхОрдеров.Проверен;
		//	СтатусОтгрузки	   = Ложь;
		//	ЗаданиеНаПеревозку = Документы.ЗаданиеНаПеревозку.ПустаяСсылка();
		//КонецЕсли; 
		СтатусОтгрузки     = Истина;
		ЗаданиеНаПеревозку = Источник.Ссылка;
		СтатусОрдера = ?(
			Источник.Статус = Перечисления.СтатусыЗаданийНаПеревозку.КПогрузке, 
			Перечисления.СтатусыРасходныхОрдеров.КОтгрузке, 
			Перечисления.СтатусыРасходныхОрдеров.Проверен);
		//-- 25.02.2025 КОМПИТ
		
		Для Каждого тСтрока Из ТоварыКДоставке Цикл
			Если ТипЗнч(тСтрока.Распоряжение) = Тип("ДокументСсылка.ПоручениеЭкспедитору") Тогда
				Продолжить;
			КонецЕсли;
			ТзОрдера = ПолучитьИнформациюПоРасходномуОрдеру(тСтрока.Распоряжение, тСтрока.Назначение, тСтрока.Номенклатура, тСтрока.Характеристика, тСтрока.ВсеТовары);
			Если НЕ ТзОрдера = Неопределено Тогда
				Для Каждого СтрОрдер Из ТзОрдера Цикл
					СтруктураПоиска = Новый Структура("Распоряжение, _ЗаявкаНаДоставку", СтрОрдер.Распоряжение, СтрОрдер.ЗаявкаНаДоставку);
					НыйденныеСтроки = ТзРаспоряжения.НайтиСтроки(СтруктураПоиска);
					Если НыйденныеСтроки.Количество() = 0 Тогда
						Продолжить;
					КонецЕсли;
					ТекОрдер = СтрОрдер.Ссылка;
					Если НЕ ТекОрдер = Документы.РасходныйОрдерНаТовары.ПустаяСсылка() И ТекОрдер.Проведен И (ТекОрдер.Статус = Перечисления.СтатусыРасходныхОрдеров.Проверен ИЛИ ТекОрдер.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтгрузке) Тогда
						Если ТекОрдер.ЗаданиеНаПеревозку = ЗаданиеНаПеревозку И ТекОрдер.ОтгрузкаПоЗаданиюНаПеревозку = СтатусОтгрузки И ТекОрдер.Статус = СтатусОрдера Тогда
							продолжить;
						КонецЕсли; 
						ДокОрдер							  = ТекОрдер.ПолучитьОбъект();
						ДокОрдер.ЗаданиеНаПеревозку			  = ЗаданиеНаПеревозку;
						ДокОрдер.ОтгрузкаПоЗаданиюНаПеревозку = СтатусОтгрузки;
						ДокОрдер.Статус						  = СтатусОрдера;
						Если НЕ ДокОрдер._СпособДоставки = Источник.ТранспортноеСредство Тогда
							ДокОрдер._СпособДоставки		  = Источник.ТранспортноеСредство;
						КонецЕсли;
						ДокОрдер.Записать();
					КонецЕсли;
				КонецЦикла;		// ТекОрдер Из ТзОрдера 
			КонецЕсли; 
		КонецЦикла;		// тСтрока Из ТоварыКДоставке
	ИначеЕсли Источник.Статус = Перечисления.СтатусыЗаданийНаПеревозку.Формируется Тогда
		ДополнительноОтменеПроведенияДокументаОбработкаУдаленияПроведения(Источник, Отказ)
	КонецЕсли;
	
КонецПроцедуры	// ДополнительноПриПроведенииДокументов()

Процедура ДополнительноОтменеПроведенияДокументаОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	//тОрдер = Документы.РасходныйОрдерНаТовары.ПустаяСсылка();
	Если Источник.Статус = Перечисления.СтатусыЗаданийНаПеревозку.КПогрузке ИЛИ Источник.Статус = Перечисления.СтатусыЗаданийНаПеревозку.Формируется Тогда
		ТоварыКДоставке = ЗаполнитьТоварыКДоставке(Источник);
		
		Для Каждого тСтрока Из ТоварыКДоставке Цикл
			Если ТипЗнч(тСтрока.Распоряжение) = Тип("ДокументСсылка.ПоручениеЭкспедитору") ИЛИ ТипЗнч(тСтрока.Распоряжение) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
				Продолжить;
			КонецЕсли;  
			//Сообщить(СокрЛП(тСтрока.Распоряжение));
			//Сообщить(СокрЛП(ТипЗнч(тСтрока.Распоряжение)));
			Ответ = ПолучитьИнформациюПоРасходномуОрдеру(тСтрока.Распоряжение, тСтрока.Назначение, тСтрока.Номенклатура,тСтрока.Характеристика, тСтрока.ВсеТовары,);
			Если Ответ = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если Ответ.Количество() > 0 Тогда
				Для Каждого Стр Из Ответ Цикл
					мОрдер = Стр.Ссылка;
					Если мОрдер.Проведен И (мОрдер.Статус = Перечисления.СтатусыРасходныхОрдеров.Проверен ИЛИ  мОрдер.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтгрузке ) Тогда
						ДокОрдер                              = мОрдер.ПолучитьОбъект();
						ДокОрдер.ЗаданиеНаПеревозку           = Документы.ЗаданиеНаПеревозку.ПустаяСсылка();
						ДокОрдер.ОтгрузкаПоЗаданиюНаПеревозку = Истина;
						ДокОрдер.Статус                       = Перечисления.СтатусыРасходныхОрдеров.Проверен;
						ДокОрдер.Записать();
					ИначеЕсли мОрдер.Проведен И мОрдер.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен Тогда
						Отказ = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			//мОрдер = Ответ.Ссылка;
			//Если НЕ тОрдер = мОрдер Тогда
			//	Если мОрдер.Проведен И (мОрдер.Статус = Перечисления.СтатусыРасходныхОрдеров.Проверен ИЛИ  мОрдер.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтгрузке ) Тогда
			//		тОрдер						= мОрдер;
			//		ДокОрдер					= мОрдер.ПолучитьОбъект();
			//		ДокОрдер.ЗаданиеНаПеревозку = Документы.ЗаданиеНаПеревозку.ПустаяСсылка();
			//		ДокОрдер.ОтгрузкаПоЗаданиюНаПеревозку = Истина;
			//		ДокОрдер.Статус				= Перечисления.СтатусыРасходныхОрдеров.Проверен;
			//		ДокОрдер.Записать();
			//	ИначеЕсли мОрдер.Проведен И мОрдер.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен Тогда
			//		Отказ						= Истина;
			//	КонецЕсли;
			//КонецЕсли;
			
		КонецЦикла;		// тСтрока Из ТоварыКДоставке
		
	КонецЕсли;
КонецПроцедуры

Процедура ДополнительноПриОтменеМаршрута(Распоряжение) Экспорт
	
			//Если ТипЗнч(тСтрока.Распоряжение) = Тип("ДокументСсылка.ПоручениеЭкспедитору") Тогда
			//	Продолжить;
			//КонецЕсли;
			//мОрдер = ПолучитьИнформациюПоРасходномуОрдеру(Распоряжение, тСтрока.Назначение, тСтрока.Номенклатура,тСтрока.Характеристика, тСтрока.ВсеТовары).Ссылка;
			//Если НЕ тОрдер = мОрдер Тогда
			//	Если мОрдер.Проведен И (мОрдер.Статус = Перечисления.СтатусыРасходныхОрдеров.Проверен ИЛИ  мОрдер.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтгрузке ) Тогда
			//		тОрдер   = мОрдер;
			//		ДокОрдер = мОрдер.ПолучитьОбъект();
			//		ДокОрдер.ЗаданиеНаПеревозку = Документы.ЗаданиеНаПеревозку.ПустаяСсылка();
			//		ДокОрдер.ОтгрузкаПоЗаданиюНаПеревозку = Истина;
			//		ДокОрдер.Статус = Перечисления.СтатусыРасходныхОрдеров.Проверен;
			//		ДокОрдер.Записать();
			//	ИначеЕсли мОрдер.Проведен И мОрдер.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен Тогда
			//		Отказ    = Истина;
			//	КонецЕсли;
			//КонецЕсли;
			
КонецПроцедуры	// ДополнительноПриОтменеМаршрута()

//**ДОБАВЛЕНО МАКСИМОВ В.А.

Процедура _ПриПроведенииДокументаДСОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт

	Если Источник.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента Тогда
		Для Каждого Строка Из Источник.РасшифровкаПлатежа Цикл
			Попытка
				Док = Строка.ОснованиеПлатежа.ПолучитьОбъект();
				Док.Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению;
				Док.Записать();
			Исключение
				Продолжить;
			КонецПопытки;	
		КонецЦикла;	
    КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

Функция ПолучитьСостояниеЗаказаКлиента(ЗаказКлиента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СостоянияЗаказовКлиентов.Заказ КАК Заказ,
	|	СостоянияЗаказовКлиентов.Состояние КАК Состояние
	|ИЗ
	|	РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|ГДЕ
	|	СостоянияЗаказовКлиентов.Заказ = &ЗаказКлиента";
	
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Перечисления.СостоянияЗаказовКлиентов.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Результат.Выгрузить()[0].Состояние
	
КонецФункции // ПолучитьСостояниеЗаказаКлиента()

Функция ПроверитьПоступлениеПоЗаказуПоставщику(Источник, Заказ) Экспорт
	
	Если Заказ = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	мТекст = СокрЛП(Сред(Строка(ТипЗнч(Источник)), 18)) + " № " + Источник.Номер + " от " + Формат(Источник.Дата,"ДФ=""дд.ММ.гг 'г.'""");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриобретениеТоваровУслугТовары.Ссылка КАК Ссылка,
	               |	ПриобретениеТоваровУслугТовары.Назначение КАК Назначение,
	               |	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |	ПриобретениеТоваровУслугТовары.Характеристика КАК Характеристика,
	               |	ПриобретениеТоваровУслугТовары.Серия КАК Серия,
	               |	ПриобретениеТоваровУслугТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	ПриобретениеТоваровУслугТовары.Количество КАК Количество
	               |ИЗ
	               |	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	               |ГДЕ
	               |	ПриобретениеТоваровУслугТовары.ЗаказПоставщику = &Заказ";
	
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	ТЗТваровПоЗаказу = Запрос.Выполнить().Выгрузить();
	ТЗТваровПоЗаказу.Свернуть("Номенклатура, Характеристика", "КоличествоУпаковок, Количество");
	
	ТзЗаказы		 = Заказ.Товары.Выгрузить();
	ТзЗаказы.Свернуть("Номенклатура, Характеристика", "КоличествоУпаковок, Количество");
	
	Если ТЗТваровПоЗаказу.Количество() > 0 Тогда
		Для Каждого ТекСтрока Из ТзЗаказы Цикл
			ПараметрыПоиска   = Новый Структура("Номенклатура, Характеристика", ТекСтрока.Номенклатура, ТекСтрока.Характеристика);
			Строки 			  = ТЗТваровПоЗаказу.НайтиСтроки(ПараметрыПоиска);
			
			Если Строки.Количество() > 0 Тогда
				Для Каждого СтрокаЗаказа Из Строки Цикл
					ТекСтрока.КоличествоУпаковок = ТекСтрока.КоличествоУпаковок - СтрокаЗаказа.КоличествоУпаковок ;
					ТекСтрока.Количество		 = ТекСтрока.Количество			- СтрокаЗаказа.Количество ;
				КонецЦикла;		// СтрокаЗаказа Из Строки
			КонецЕсли; 
		КонецЦикла;		// ТекСтрока Из ТЗТваровПоЗаказу 
		
		Если ТзЗаказы.Итог("КоличествоУпаковок") = 0 Тогда
			мТекст = "Весь товар по заказу: Поступил";
		КонецЕсли;	
	КонецЕсли;
	
	Возврат мТекст;	
	
КонецФункции // ПостулениеТовара()



#КонецОбласти

#Область ПреобразованияМассивТаблицаЗначений 

// Функция преобразует ТаблицуЗначений в Массив из структур.
//
Функция ПреобразоватьТаблицуЗначенийВМассив(тзДанные) Экспорт
    
    мсДанные = Новый Массив;
        
    // Запишем в массив
    Для Каждого СтрокаТЗ Из тзДанные Цикл
        
        стСтрокаТаблицы = Новый Структура;
        Для Каждого ИмяКолонки Из тзДанные.Колонки Цикл
            стСтрокаТаблицы.Вставить(ИмяКолонки.Имя, СтрокаТЗ[ИмяКолонки.Имя]);
        КонецЦикла;
        
        мсДанные.Добавить(стСтрокаТаблицы);
        
    КонецЦикла;
    
    Возврат мсДанные;
    
КонецФункции // ПреобразоватьТаблицуЗначенийВМассив()

// Функция преобразует Массив из структур в ТаблицуЗначений.
//
Функция ПреобразоватьМассивВТаблицуЗначений(мсДанные) Экспорт
    
    тзДанные = Новый ТаблицаЗначений;
    
    Для Каждого ЭлементМассива Из мсДанные Цикл
        // Рисуем колонки для таблицы
        Если тзДанные.Колонки.Количество() = 0 Тогда
            Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
                тзДанные.Колонки.Добавить(ЗначениеСтруктуры.Ключ);
            КонецЦикла;
        КонецЕсли;
        
        // Добавляем данные в таблицу
        НоваяСтрока = тзДанные.Добавить();
        Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
            НоваяСтрока[ЗначениеСтруктуры.Ключ] = ЗначениеСтруктуры.Значение;
        КонецЦикла;
    КонецЦикла;
    
    Возврат тзДанные;
    
КонецФункции // ПреобразоватьМассивВТаблицуЗначений()

#КонецОбласти

#Область ОюработкаЗаказаКлиента

Функция ПараметрыРазбиенияСтроки() Экспорт
	
	ПараметрыРазбиенияСтроки = Новый Структура;
	ПараметрыРазбиенияСтроки.Вставить("ИмяПоляКоличество", 			"Количество");
	ПараметрыРазбиенияСтроки.Вставить("ИмяКоличествоУпаковок", 		"КоличествоУпаковок");
	ПараметрыРазбиенияСтроки.Вставить("РазрешитьНулевоеКоличество",	Истина);
	ПараметрыРазбиенияСтроки.Вставить("Количество", 				Неопределено);
	
	Возврат ПараметрыРазбиенияСтроки;
	
КонецФункции

Функция ОпределитьАвтораБлокировки(Ссылка)

 ЖурналРегистрации = Новый ТаблицаЗначений;
 Фильтр = Новый Структура;
 Фильтр.Вставить("Данные", Ссылка);
 ВыгрузитьЖурналРегистрации(ЖурналРегистрации, Фильтр, "Пользователь",,1);

КонецФункции

Процедура ЗаписатьДокументКлиента(ОбъектДок, РежимПроведения = Ложь) Экспорт
	
	//**Изменено 25.09.19 Максимов
	//Попытка
		УстановитьПривилегированныйРежим(Истина);
		//ОбъектДок.Заблокировать();
		Если РежимПроведения Тогда
			ОбъектДок.Записать(РежимЗаписиДокумента.Проведение);
		Иначе			// РежимПроведения
			ОбъектДок.Записать();
		КонецЕсли;		// РежимПроведения
	  	ОбъектДок.Разблокировать();
		УстановитьПривилегированныйРежим(Ложь);
	//Исключение
	//	//Блокировщик = ОпределитьАвтораБлокировки(ОбъектДок.Ссылка);
	//	ТекстОшибки = НСтр("ru='Нет возможности записать %Документ% - Закройте документ.'");
	//	ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ОбъектДок);
	//КонецПопытки;

	
КонецПроцедуры	// ЗаписатьДокументКлиента()

#КонецОбласти

#Область ПересчетСуммТЧ

// Пересчитывает сумму товара в текущей строке табличной части документа.
//
// Параметры:
//	ТекущаяСтрока - Структура - структура со свойствами строки документа.
//	СтруктураДействий - Структура - структура с действиями, которые нужно произвести.
//	КэшированныеЗначения - Структура - кэшированные значения.
//
Процедура ПересчитатьСуммуВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий) Экспорт

	ИмяКоличества = Неопределено;
	
	Если СтруктураДействий.Свойство("ПересчитатьСумму", ИмяКоличества) Тогда
		Если НЕ ЗначениеЗаполнено(ИмяКоличества) Тогда
			ИмяКоличества = "КоличествоУпаковок"
		Конецесли;
		Если ТекущаяСтрока <> Неопределено Тогда
			ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока[ИмяКоличества];
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПересчитатьСуммуНДСВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий) Экспорт 
	
	Перем СтруктураПараметровДействия;
	Перем СтавкаНДС;
	Перем НалогообложениеНДС;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуНДС", СтруктураПараметровДействия) Тогда
		
		Если СтруктураПараметровДействия <> Неопределено И СтруктураПараметровДействия.Свойство("НалогообложениеНДС", НалогообложениеНДС) Тогда
			Если НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя") Тогда
				ТекущаяСтрока.СуммаНДС = 0;
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Если Не СтруктураПараметровДействия.Свойство("СтавкаНДС", СтавкаНДС) Тогда
			СтавкаНДС = ТекущаяСтрока.СтавкаНДС;
		КонецЕсли;
		
		НДСпоСтавкам4и2 = СтруктураПараметровДействия <> Неопределено
				И СтруктураПараметровДействия.Свойство("НДСпоСтавкам4и2")
				И СтруктураПараметровДействия.НДСпоСтавкам4и2;
		
//**  		ТекПроцентНДС = ЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(СтавкаНДС);
		ТекущаяСтрока.СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(ТекущаяСтрока.Сумма, СтавкаНДС, СтруктураПараметровДействия.ЦенаВключаетНДС);
		
	КонецЕсли;
	
КонецПроцедуры

// Пересчитывает стоимость товара с НДС в текущей строке табличной части документа.
//
// Параметры:
//	ТекущаяСтрока - Структура - структура со свойствами строки документа.
//	СтруктураДействий - Структура - структура с действиями, которые нужно произвести.
//	КэшированныеЗначения - Структура - кэшированные значения.
//
Процедура ПересчитатьСуммуСНДСВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий) Экспорт
	
	Перем СтруктураПараметровДействия;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуСНДС", СтруктураПараметровДействия) Тогда
		
		ТекущаяСтрока.СуммаСНДС = ТекущаяСтрока.Сумма + ?(СтруктураПараметровДействия.ЦенаВключаетНДС, 0, ТекущаяСтрока.СуммаНДС);
		
	КонецЕсли;
	
КонецПроцедуры

// Пересчитывает стоимость товара без НДС в текущей строке табличной части документа.
//
// Параметры:
//	ТекущаяСтрока - Структура - структура со свойствами строки документа.
//	СтруктураДействий - Структура - структура с действиями, которые нужно произвести.
//
Процедура ПересчитатьСуммуБезНДСВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий) Экспорт
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуБезНДС") Тогда
		
		ТекущаяСтрока.СуммаБезНДС = ТекущаяСтрока.Сумма - ТекущаяСтрока.СуммаНДС;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, Объект) Экспорт
	
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
//	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

Функция ПолучитьПустуюСсылку(ТипДокумента) Экспорт
	
	Если ТипДокумента = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		мДокумент = Документы.ЗаказКлиента.ПустаяСсылка();
	КонецЕсли;
	Возврат мДокумент;	
КонецФункции // ПолучитьПустуюСсылкуДокумента()

Функция ПолучитьОбъектПоСсылке(ДокументСсылка) Экспорт
	мПарам = Новый Структура("ДокументОбъект", ДокументСсылка.ПолучитьОбъект());
	Возврат мПарам;
КонецФункции // ПолучитьОбъектПоСсылке(Объект.ДокументОснование)()

Функция ПолучитьДоступКполямДокумента() Экспорт
	Если РольДоступна("АдминистраторСистемы") ИЛИ РольДоступна("Администрирование") Тогда
		Возврат Константы._РазрешенДоступКПолямДокумента.Получить();
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // ПолучитьДоступКполямДокумента()

Функция ПолучитьПустуюНоменклатуру() Экспорт
	Возврат Справочники.Номенклатура.ПустаяСсылка();
КонецФункции // ПолучитьПустуюНоменклатуру()

Функция ПолучитьУИДМенеджера(Менеджер) Экспорт
	
	Возврат Менеджер.ИдентификаторПользователяИБ;
	
КонецФункции // ПолучитьМенеджера()

Функция ПолучитьСсылкуМенеджера(УИДМенеджера) Экспорт
	
	Если (СтрДлина(УИДМенеджера) = 36) И (Сред(Новый УникальныйИдентификатор(),9,1) = "-") И (Сред(Новый УникальныйИдентификатор(),14,1) = "-") И (Сред(Новый УникальныйИдентификатор(),24,1) = "-") Тогда
		Возврат Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ",Новый УникальныйИдентификатор(УИДМенеджера)); 
	КонецЕсли;
	
	Возврат Справочники.Пользователи.ПустаяСсылка(); 
	
КонецФункции // ПолучитьМенеджера()

Функция ПолучитьРежимУИД() Экспорт
//**  	Возврат Константы._РедактированиеУИД.Получить();
КонецФункции // ПолучитьРежимУИД()

#КонецОбласти

#Область ЗадачиПользователю

Функция ПроверитьПоступление(Источник, Заказ)
	
	Если Заказ = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	мТекст = СокрЛП(Сред(Строка(ТипЗнч(Источник)), 18)) + " № " + Источник.Номер + " от " + Формат(Источник.Дата,"ДФ=""дд.ММ.гг 'г.'""");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриобретениеТоваровУслугТовары.Ссылка КАК Ссылка,
	               |	ПриобретениеТоваровУслугТовары.Назначение КАК Назначение,
	               |	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |	ПриобретениеТоваровУслугТовары.Характеристика КАК Характеристика,
	               |	ПриобретениеТоваровУслугТовары.Серия КАК Серия,
	               |	ПриобретениеТоваровУслугТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	ПриобретениеТоваровУслугТовары.Количество КАК Количество
	               |ИЗ
	               |	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	               |		ПО ПриобретениеТоваровУслугТовары.Назначение = Назначения.Ссылка
	               |ГДЕ
	               |	Назначения.Заказ = &Заказ";
	
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	ТЗТваровПоЗаказу = Запрос.Выполнить().Выгрузить();
	ТЗТваровПоЗаказу.Свернуть("Номенклатура, Характеристика, Серия", "КоличествоУпаковок, Количество");
	
	ТзЗаказы		 = Заказ.Товары.Выгрузить();
	ТзЗаказы.Свернуть("Номенклатура, Характеристика, Серия", "КоличествоУпаковок, Количество");
	
	Если ТЗТваровПоЗаказу.Количество() > 0 Тогда
		Для Каждого ТекСтрока Из ТзЗаказы Цикл
			ПараметрыПоиска   = Новый Структура("Номенклатура, Характеристика, Серия", ТекСтрока.Номенклатура, ТекСтрока.Характеристика, ТекСтрока.Серия);
			Строки 			  = ТЗТваровПоЗаказу.НайтиСтроки(ПараметрыПоиска);
			
			Если Строки.Количество() > 0 Тогда
				Для Каждого СтрокаЗаказа Из Строки Цикл
					ТекСтрока.КоличествоУпаковок = ТекСтрока.КоличествоУпаковок - СтрокаЗаказа.КоличествоУпаковок ;
					ТекСтрока.Количество		 = ТекСтрока.Количество			- СтрокаЗаказа.Количество ;
				КонецЦикла;		// СтрокаЗаказа Из Строки
			КонецЕсли; 
		КонецЦикла;		// ТекСтрока Из ТЗТваровПоЗаказу 
		
		Если ТзЗаказы.Итог("КоличествоУпаковок") = 0 Тогда
			мТекст = "Весь товар по заказу: Поступил";
		КонецЕсли;	
	КонецЕсли;
	
	Возврат мТекст;	
	
КонецФункции // ПостулениеТовара()


Процедура СозданиеЗадач(Источник, Заказ)
	
		Если ПроверитьПоступление(Источник, Заказ) = "Весь товар по заказу: Поступил" Тогда
			ПараметрыЗадачи = ПолучитьПараметрыЗадачи();
			ПараметрыЗадачи.Исполнитель		= Заказ.Автор;
			ПараметрыЗадачи.ДатаИсполнения	= ТекущаяДата();
			ПараметрыЗадачи.Предмет			= Заказ.Ссылка;
			ПараметрыЗадачи.Наименование	= "Отгрузка по Заказу клиента № " + 
											   Заказ.Номер + " от " + Формат(Заказ.Дата,"ДФ=""дд.ММ.гг 'г.'""");
			ПараметрыЗадачи.Описание		= "По Заказу клиента № " + 
											   Заказ.Номер + " от " + Формат(Заказ.Дата,"ДФ=""дд.ММ.гг 'г.'""") + 
											   "  - поступил весь товар. Необходимо провести отгрузку товара клиенту";
			ПараметрыЗадачи.ПредметСтрокой	= Строка(Заказ);
			ПараметрыЗадачи.Автор			= Константы._АвторСистемныхЗдач.Получить();
			ПараметрыЗадачи.АвторСтрокой	= Строка(Константы._АвторСистемныхЗдач.Получить());
			СоздатьЗадачуИсполнителю(ПараметрыЗадачи);
		КонецЕсли;
	
КонецПроцедуры	// СозданиеЗадач()

//**ДОБАВЛЕНО Максимов В.А.

Процедура СозданиеЗадачЗакупщика(Источник, Заказ)
	
	Если ПроверитьПоступлениеПоЗаказуПоставщику(Источник, Заказ) = "Весь товар по заказу: Поступил" Тогда
		ПараметрыЗадачи = ПолучитьПараметрыЗадачи();
		ПараметрыЗадачи.Исполнитель		= Заказ.Автор;
		ПараметрыЗадачи.ДатаИсполнения	= ТекущаяДата();
		ПараметрыЗадачи.Предмет			= Заказ.Ссылка;
		ПараметрыЗадачи.Наименование	= "Приход по Заказу поставщику № " + 
										   Заказ.Номер + " от " + Формат(Заказ.Дата,"ДФ=""дд.ММ.гг 'г.'""");
		ПараметрыЗадачи.Описание		= "По Заказу поставщику № " + 
										   Заказ.Номер + " от " + Формат(Заказ.Дата,"ДФ=""дд.ММ.гг 'г.'""") + 
										   "  - поступил весь товар.";
		ПараметрыЗадачи.ПредметСтрокой	= Строка(Заказ);
		ПараметрыЗадачи.Автор			= Константы._АвторСистемныхЗдач.Получить();
		ПараметрыЗадачи.АвторСтрокой	= Строка(Константы._АвторСистемныхЗдач.Получить());
		СоздатьЗадачуИсполнителю(ПараметрыЗадачи);
	КонецЕсли;
	
КонецПроцедуры

Процедура СозданиеЗадачЗакупщикаЗаказПросрочен(Заказ) Экспорт
	
	ПараметрыЗадачи = ПолучитьПараметрыЗадачи();
	ПараметрыЗадачи.Исполнитель		= Заказ.Автор;
	ПараметрыЗадачи.ДатаИсполнения	= ТекущаяДата();
	ПараметрыЗадачи.Предмет			= Заказ;
	ПараметрыЗадачи.Наименование	= "Просрочен приход по Заказу поставщику № " + 
									   Заказ.Номер + " от " + Формат(Заказ.Дата,"ДФ=""дд.ММ.гг 'г.'""");
	ПараметрыЗадачи.Описание		= "По Заказу поставщику № " + 
									   Заказ.Номер + " от " + Формат(Заказ.Дата,"ДФ=""дд.ММ.гг 'г.'""") + 
									   "  - товар не поступил.";
	ПараметрыЗадачи.ПредметСтрокой	= Строка(Заказ);
	ПараметрыЗадачи.Автор			= Константы._АвторСистемныхЗдач.Получить();
	ПараметрыЗадачи.АвторСтрокой	= Строка(Константы._АвторСистемныхЗдач.Получить());
	СоздатьЗадачуИсполнителю(ПараметрыЗадачи);
	
КонецПроцедуры


//*************************

Процедура СоздатьЗадачуИсполнителю(ПараметрыЗадачи) Экспорт
	
	//Если СозданаЗадачаИсполнителю(ПараметрыЗадачи) Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//БизнесПроцессОбъект					= БизнесПроцессы.Задание.СоздатьБизнесПроцесс();
	//
	//БизнесПроцессОбъект.Дата		 	= ТекущаяДата();
	//БизнесПроцессОбъект.СрокИсполнения	= ДобавитьДнейКДате(ТекущаяДата(), Константы._КоличествоДнейНаИсполненинЗадачи.Получить());
	//
	//БизнесПроцессОбъект.Автор			= ПараметрыЗадачи.Автор;
	//БизнесПроцессОбъект.АвторСтрокой	= ПараметрыЗадачи.АвторСтрокой;
	//БизнесПроцессОбъект.Исполнитель		= ПараметрыЗадачи.Исполнитель;
	//
	//БизнесПроцессОбъект.Наименование	= ПараметрыЗадачи.Наименование;
	//БизнесПроцессОбъект.Предмет			= ПараметрыЗадачи.Предмет;
	//БизнесПроцессОбъект.Содержание		= ПараметрыЗадачи.Описание;
	//
	//БизнесПроцессОбъект.Выполнено	 	= Ложь;
	//БизнесПроцессОбъект.Завершен	 	= Ложь;
	//БизнесПроцессОбъект.Стартован	 	= Ложь;
	//БизнесПроцессОбъект.Состояние	 	= Перечисления.СостоянияБизнесПроцессов.Активен;
	//БизнесПроцессОбъект.Важность	 	= Перечисления.ВариантыВажностиЗадачи.Обычная;
	//БизнесПроцессОбъект.Записать();
	//
	//БизнесПроцессОбъект.Старт();
    
КонецПроцедуры	// СоздатьЗадачуИсполнителю()

Функция ПолучитьПараметрыЗадачи()
	Возврат Новый Структура("Исполнитель, Автор, АвторСтрокой, ДатаИсполнения, Описание, Наименование, Предмет, ПредметСтрокой");
КонецФункции // ПолучитьПараметрыЗадачи()

Функция ДобавитьДнейКДате(ТекДата, КолДней) Экспорт
	
	ОдинДень   = 60 * 60 * 24;
	ДатаНаДень = ТекДата + (ОдинДень * КолДней);
	
	СдвигДаты  = 0;
	Если ДеньНедели(ДатаНаДень) = 6 Тогда
		СдвигДаты  = 2;
	ИначеЕсли ДеньНедели(ДатаНаДень) = 7 Тогда
		СдвигДаты  = 1;
	ИначеЕсли ДеньНедели(ДатаНаДень) = 1 Тогда
		СдвигДаты  = 2;
	КонецЕсли;
	
	Возврат ТекДата + (ОдинДень * (КолДней + СдвигДаты));
	
КонецФункции

Функция СозданаЗадачаИсполнителю(ПараметрыЗадачи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеБизнесПроцессов.БизнесПроцесс КАК БизнесПроцесс,
	               |	ДанныеБизнесПроцессов.Номер КАК Номер,
	               |	ДанныеБизнесПроцессов.Дата КАК Дата,
	               |	ДанныеБизнесПроцессов.Завершен КАК Завершен,
	               |	ДанныеБизнесПроцессов.Стартован КАК Стартован,
	               |	ДанныеБизнесПроцессов.Автор КАК Автор,
	               |	ДанныеБизнесПроцессов.ДатаЗавершения КАК ДатаЗавершения,
	               |	ДанныеБизнесПроцессов.Наименование КАК Наименование,
	               |	ДанныеБизнесПроцессов.ПометкаУдаления КАК ПометкаУдаления
	               |ИЗ
	               |	РегистрСведений.ДанныеБизнесПроцессов КАК ДанныеБизнесПроцессов
	               |ГДЕ
	               |	ДанныеБизнесПроцессов.Наименование = &Наименование
	               |	И ДанныеБизнесПроцессов.БизнесПроцесс.Исполнитель = &Исполнитель";
	
	Запрос.УстановитьПараметр("Наименование", ПараметрыЗадачи.Наименование);
	Запрос.УстановитьПараметр("Исполнитель",  ПараметрыЗадачи.Исполнитель);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // ПолучитьЗадачу()

//РИВ
Функция ВернутьЗаявкаНаДоставкуНомер(Распоряжение, СпособДоставки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	_ЗаявкаНаДоставку.Ссылка КАК Ссылка,
	|	_ЗаявкаНаДоставку.ДокументОснование КАК ДокументОснование,
	|	_ЗаявкаНаДоставку.Номер КАК Номер
	|ИЗ
	|	Документ._ЗаявкаНаДоставку КАК _ЗаявкаНаДоставку
	|ГДЕ
	|	_ЗаявкаНаДоставку.ДокументОснование = &ДокументОснование
	|	И НЕ _ЗаявкаНаДоставку.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ДокументОснование", Распоряжение);
	Запрос.УстановитьПараметр("СпособДоставки", СпособДоставки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
		
	КонецЦикла;
	
КонецФункции // ВернутьЗаявкаНаДоставкуНомер()
//РИВ

//++ Сухарев Б.В. 24.06.2019
Функция ПолучитьИнформациюПоРасходномуОрдеру(Распоряжение, Назначение, Номенклатура, Характеристика, ВсеТовары = Ложь, ПоРабСтолу = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Если ВсеТовары Тогда
		Запрос.Текст ="ВЫБРАТЬ РАЗЛИЧНЫЕ
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Ссылка,
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка._ЗаявкаНаДоставку КАК ЗаявкаНаДоставку,
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Склад КАК Склад,
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение,
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Назначение КАК Назначение,
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура КАК Номенклатура,
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Характеристика КАК Характеристика,
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка._СпособДоставки КАК СпособДоставки
		              |ИЗ
		              |	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
		              |ГДЕ
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение = &Распоряжение
		              |	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Проведен = ИСТИНА
		              |
		              |УПОРЯДОЧИТЬ ПО
		              |	Ссылка УБЫВ
		              |АВТОУПОРЯДОЧИВАНИЕ";
	Иначе
		Запрос.Текст ="ВЫБРАТЬ РАЗЛИЧНЫЕ
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Ссылка,
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка._ЗаявкаНаДоставку КАК ЗаявкаНаДоставку,
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Склад КАК Склад,
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение,
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Назначение КАК Назначение,
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура КАК Номенклатура,
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Характеристика КАК Характеристика,
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка._СпособДоставки КАК СпособДоставки
		              |ИЗ
		              |	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
		              |ГДЕ
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение = &Распоряжение
		              |	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Назначение = &Назначение
		              |	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура = &Номенклатура
		              |	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Характеристика = &Характеристика
		              |	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Проведен = ИСТИНА
		              |
		              |УПОРЯДОЧИТЬ ПО
		              |	Ссылка УБЫВ
		              |АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("Назначение",     Назначение);
		Запрос.УстановитьПараметр("Номенклатура",   Номенклатура);
		Запрос.УстановитьПараметр("Характеристика", Характеристика);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Распоряжение",   Распоряжение);
	
	Результат = Запрос.Выполнить();
	Если  НЕ Результат.Пустой() Тогда
		Если ПоРабСтолу Тогда
			Выборка	  = Результат.Выгрузить()[0];
		Иначе
			Выборка	  = Результат.Выгрузить();
		КонецЕсли;
		
		Возврат Выборка
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции // ПолучитьИнформациюПоРасходномуОрдеру()

Функция ЗаполнитьТоварыКДоставке(ТекОбъект) Экспорт
	
	ТоварыКДоставке = Новый ТаблицаЗначений;
	
	НаборЗаписей = РегистрыСведений.ТоварыКДоставке.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЗаданиеНаПеревозку.Установить(ТекОбъект.Ссылка);
	НаборЗаписей.Прочитать();
	ТоварыКДоставке = НаборЗаписей.Выгрузить();
	
	Возврат ТоварыКДоставке;
	
КонецФункции	

#КонецОбласти

#Область ОбработкаДАТЫ

&НаСервере
Функция ПроверитьДату(ДатаПроверки, ГодПроверки ) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеПроизводственногоКалендаря.Дата КАК Дата,
	               |	ДанныеПроизводственногоКалендаря.ВидДня КАК ВидДня
	               |ИЗ
	               |	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	               |ГДЕ
	               |	ДанныеПроизводственногоКалендаря.Дата = &ДатаПроверки
	               |	И ДанныеПроизводственногоКалендаря.Год = &ГодПроверки
				   |";
	
	Запрос.УстановитьПараметр("ДатаПроверки",НачалоДня(ДатаПроверки));
	Запрос.УстановитьПараметр("ГодПроверки" ,ГодПроверки);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	//Если Выборка.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий Тогда
		Возврат Истина;
	//Иначе
	//	Возврат Ложь;
	//КонецЕсли;
		 	
КонецФункции // ПроверитьДату()

&НаСервере
Функция ПолучитьСледующийДень(ДатаПроверки, БольшеСемнадцати = Истина) Экспорт
	
	Сутки = 60 * 60 * 24; 
	Если БольшеСемнадцати Тогда
		Если ДатаПроверки >= Дата(Год(ТекущаяДата()), Месяц(ТекущаяДата()), День(ТекущаяДата()),  17, 0, 0) Тогда
			НоваяДата = ТекущаяДата() + Сутки * 2;
		Иначе
			НоваяДата = ТекущаяДата() + Сутки;
		КонецЕсли;
	Иначе
		НоваяДата = ТекущаяДата() + Сутки;
	КонецЕсли;
	
	Пока НЕ ПроверитьДату(НоваяДата, Год(НоваяДата)) Цикл
		НоваяДата = НоваяДата + Сутки
	КонецЦикла;		// 
	
	Возврат НоваяДата;
	
КонецФункции // ПолучитьСледующийДень()

Процедура _ПриПроведенииДокументаПоступлениеДСОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт

	Для Каждого Стр Из Источник.РасшифровкаПлатежа Цикл
		Если ТипЗнч(Стр.ОснованиеПлатежа) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			Если НЕ ЗначениеЗаполнено(Стр.ОснованиеПлатежа) Тогда
				Продолжить;
			КонецЕсли;	
			Док = Стр.ОснованиеПлатежа.ПолучитьОбъект();
			Док.Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению;
			Попытка
				Если Док.ПометкаУдаления = Истина Тогда
					Если Док.Дата > Дата("20220101") Тогда
						Док.ПометкаУдаления = Ложь;
						Док.Записать(РежимЗаписиДокумента.Проведение);
						Док.ПометкаУдаления = Истина;					
					Иначе
						
					КонецЕсли;	
				Иначе	
					Если Док.Дата > Дата("20220101") Тогда
						Док.Записать(РежимЗаписиДокумента.Проведение);
					КонецЕсли;	
				КонецЕсли;	
			Исключение
				Сообщить(""+ОписаниеОшибки());
			КонецПопытки;					
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры



#КонецОбласти
//== Сухарев Б.В
